import React from "react";
import "./RTITable.css";
import HeadingText from "../../shared-components/HeadingText";
import { motion } from "framer-motion";
import HelmetComponent from "../../shared-components/HelemetComponent";

const LoksevaTable: React.FC = () => {
  const links = [
    {
      label: "महाराष्ट्र लोकसेवा हक्क अधिनियम, 2015",
      href: "pdf/RTS_act_2015.pdf",
    },
    {
      label: "महाराष्ट्र लोकसेवा हक्क अधिनियम नियम राजपत्र",
      href: "pdf/RTS_Rules_Gazette.pdf",
    },
    {
      label: "लोकसेवा हक्क कायद्यांतर्गत अधिसूचित सेवांची यादी",
      href: "https://aaplesarkar.mahaonline.gov.in/en/CommonForm/ViewAllServices",
    },
    {
      label: "आपले सरकार सेवा केंद्राची यादी",
      href: "https://aaplesarkar.mahaonline.gov.in/en/CommonForm/SewaKendraDetails",
    },
  ];
  return (
    <div className="rti-container space-y-6">
      <HelmetComponent
        title="महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५ | आदिवासी विकास प्रकल्प शहापूर"
        description="या पृष्ठावर महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५ अंतर्गत आवश्यक माहिती व सेवा पुरविण्याची यादी उपलब्ध आहे."
        canonical="https://poitdp.shahapur-mh.in/loksevahakka"
      />
      <HeadingText text="“महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५”" />
      <p>
        “महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५” च्या नियम क्रमांक ८ नुसार,
        कायदयाच्या अंमलबजावणी करीता महाराष्ट्र राज्यात पात्र व्यक्तीना पारदर्शक,
        कार्यक्षम व समयोचित लोकसेवा देण्याकरिता आणि तत्संबंधित व तदानुषंगिक
        बाबीकरीता तरतुद करण्यासाठी या कार्यालयाचे खालीलप्रमाणे पदनिदेशित
        अधिकारी, प्रथम व द्वितीय अपिलीय अधिकारी आहेत.
      </p>

      {/* Table 1 */}
      <div className="overflow-auto border">
        <table className="min-w-[600px] w-full table-auto">
          <thead>
            <tr>
              <th>पदनिर्देशित अधिकारी</th>
              <th>प्रथम अपिलीय अधिकारी</th>
              <th>द्वितीय अपिलीय अधिकारी</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>
                श्री. ए.आर. जाधव
                <br />
                सहाय्यक प्रकल्प अधिकारी
                <br />
                एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
              </td>
              <td>
                श्री. डी.डी. काळपांडे
                <br />
                सहाय्यक प्रकल्प अधिकारी
                <br />
                एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
              </td>
              <td>
                श्री. आर.बी. हिवाळे
                <br />
                प्रकल्प अधिकारी
                <br />
                एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
              </td>
            </tr>
          </tbody>
        </table>
      </div>

      {/* Table 2 */}
      <div>
        <HeadingText text="प्रकल्प अधिकारी, एकात्मिक आदिवासी विकास प्रकल्प शहापूर जि. ठाणे" />
        <p>
          महारारष्ट्र लोकसेवा हक्क अधिनियम २०१५ (सन २०१५च्या महा. अधिनियम हमी
          क्र.३१ ) मधील कलम ३ च्या उपकलम (१) अन्वये प्रदान करण्यात आलेल्या
          आदिवासी विकास विभागाच्या अधिसूचित सेवांचा तपशिल
        </p>
        <div className="overflow-auto border mt-2">
          <table className="min-w-[800px] w-full table-auto">
            <thead>
              <tr>
                <th>अ.क्र</th>
                <th>अधिसूचित सेवेचे नांव</th>
                <th>ऑनलाईन</th>
                <th>ऑफलाईन</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>१</td>
                <td>
                  अनुसूचित जमातीच्या विदयार्थ्याना शहारातील इंग्रजी माध्यमाच्या
                  नामाकिंत निवासी शाळांमध्ये प्रवेश देणे.
                </td>
                <td>-</td>
                <td>ऑफलाईन</td>
              </tr>
              <tr>
                <td>२</td>
                <td>
                  अनुसूचित जमातीच्या विदयार्थ्यांना शालांत परिक्षेत्तर
                  शिष्यवृत्ती (भारत सरकार शिष्यवृत्ती)
                </td>
                <td>ऑनलाईन</td>
                <td>-</td>
              </tr>
              <tr>
                <td>३</td>
                <td>
                  पंडीत दीनदयाळ उपाध्याय स्वयंम योजने अंतर्गत उच्च शिक्षण
                  घेणाऱ्या शासकीय वस्तीगृहामध्ये प्रवेश न मिळालेल्या अनुसूचित
                  जमातीतील विदयार्थ्यांना अन्न, राहण्याची व्यवस्था, निर्वाह आणि
                  शैक्षणिक साहित्यासाठी आर्थिक सहाय्य
                </td>
                <td>ऑनलाईन</td>
                <td>-</td>
              </tr>
              <tr>
                <td>४</td>
                <td>
                  आदिवासी मुलांमुलीं करीता शासकीय वसतीगृहात मोफत प्रवेश देणे
                </td>
                <td>ऑनलाईन</td>
                <td>-</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>

      {/* Table 3 */}
      <div>
        <HeadingText text="प्रकल्प अधिकारी, एकात्मिक आदिवासी विकास  प्रकल्प शहापूर  जि. ठाणे" />
        <p>
          महारारष्ट्र लोकसेवा हक्क अधिनियम २०१५ (सन २०१५च्या महा. अधिनियम हमी
          क्र.३१ ) मधील कलम ३ च्या उपकलम (१) अन्वये प्रदान करण्यात आलेल्या
          आदिवासी विकास विभागाच्या अधिसूचित सेवांचा तपशिल
        </p>
        <div className="overflow-auto border">
          <table className="min-w-[1000px] w-full table-auto">
            <thead>
              <tr>
                <th>अ.क्र.</th>
                <th>लोकसेवा तप‍शिल</th>
                <th>लोकसेवा पुरविण्यासाठी विहित केलनेली कालमर्यादा </th>
                <th>पदनिर्देशित अधिकाऱ्याचे पदनाम</th>
                <th>प्रथम अपिलीय अधिकाऱ्याचे पदनाम</th>
                <th>द्वितीय अपिलीय अधिकाऱ्याचे पदनाम</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>१</td>
                <td>
                  {" "}
                  अनुसूचित जमातीच्या विदयार्थ्याना शहरातील इंग्रजी माध्यमाच्या
                  नामाकिंत निवासी शाळांमध्ये प्रवेश देणे.
                </td>
                <td>
                  राज्यस्तरीय समितीमार्फत नामांकींत शाळांची अंतीम निवड
                  झाल्यानंतर जागेच्या उपलब्धतेनुसार 60 दिवसात{" "}
                </td>
                <td>प्रकल्प अधिकारी</td>
                <td>उपआयुक्त</td>
                <td>अपर आयुक्त</td>
              </tr>
              <tr>
                <td>२</td>
                <td>
                  अनुसूचित जमातीच्या विदयार्थ्यांना शालांत परिक्षेत्तर
                  शिष्यवृत्ती (भारत सरकार शिष्यवृत्ती)
                </td>
                <td>
                  महाविदयालयाकडुन आवश्यक कागदपत्रांच्या पूर्ततेसह प्रकल्प
                  अधिकारी यांच्याकडे अर्ज प्राप्त झाल्यावर 60 दिवसात आणि
                  निधीच्या उपलब्धतेनुसार प्राथम्यक्रमानुसार{" "}
                </td>
                <td>प्रकल्प अधिकारी</td>
                <td>उपआयुक्त</td>
                <td>अपर आयुक्त</td>
              </tr>
              <tr>
                <td>३</td>
                <td>
                  पंडीत दीनदयाळ उपाध्याय स्वयंम योजने अंतर्गत उच्च उच्च शिक्षण
                  घेणाऱ्या शासकीय वस्तीगृहामध्ये प्रवेश न मिळालेल्या अनुसुचित
                  जमातीतील विदयार्थ्यांना अन्न, राहण्याची व्यवस्था निर्वाह आणि
                  शैक्षणिक साहित्यासाठी आर्थिक सहाय्य.
                </td>
                <td>
                  विदयार्थ्याकडुन आवश्यक कागदपत्रांच्या पुर्ततेसह अर्ज प्राप्त
                  झाल्यानंतर जागेच्या उपलब्धतेनुसार 60 दिवसांत
                </td>
                <td>प्रकल्प अधिकारी</td>
                <td>उपआयुक्त</td>
                <td>अपर आयुक्त</td>
              </tr>
              <tr>
                <td>४</td>
                <td>
                  आदिवासी मुलांमुलीं करीता शासकीय वसतीगृहात मोफत प्रवेश देणे.{" "}
                </td>
                <td>
                  विदयार्थ्याकडुन आवश्यक कागदपत्रांच्या पुर्ततेसह अर्ज प्राप्त
                  झाल्यानंतर जागेच्या उपलब्धतेनुसार 45 दिवसांत
                </td>
                <td>संबंधित गृहपाल</td>
                <td>सहाय्यक प्रकल्प अधिकारी</td>
                <td>प्रकल्प अधिकारी</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
      <div className="w-full flex flex-col sm:flex-row flex-wrap gap-4 p-[10px]">
        {links.map((link, index) => (
          <motion.a
            key={index}
            href={link.href}
            target="_blank"
            whileHover={{ scale: 1.05 }}
            whileTap={{ scale: 0.97 }}
            initial={{ opacity: 0, y: 10 }}
            animate={{ opacity: 1, y: 0 }}
            transition={{ duration: 0.4, delay: index * 0.1 }}
            className="bg-[#5E3023] hover:bg-[#4c261c] text-white px-5 py-2 rounded-xl text-center shadow-md transition duration-300 w-full sm:w-auto"
          >
            {link.label}
          </motion.a>
        ))}
      </div>
    </div>
  );
};

export default LoksevaTable;
