import React from "react";
import "./RTITable.css";
import HeadingText from "../../shared-components/HeadingText";

const LoksevaTable: React.FC = () => {
  return (
    <div className="rti-container">
      <HeadingText text="“महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५”" />
      <p>
        “महाराष्ट्र लोकसेवा हक्क अधिनियम २०१५” च्या नियम क्रमांक ८ नुसार,
        कायदयाच्या अंमलबजावणी करीता महाराष्ट्र राज्यात पात्र व्यक्तीना पारदर्शक,
        कार्यक्षम व समयोचित लोकसेवा देण्याकरिता आणि तत्संबंधित व तदानुषंगिक
        बाबीकरीता तरतुद करण्यासाठी या कार्यालयाचे खालीलप्रमाणे पदनिदेशित
        अधिकारी, प्रथम व द्वितीय अपिलीय अधिकारी आहेत.
      </p>

      <table>
        <thead>
          <tr>
            <th>पदनिर्देशित अधिकारी</th>
            <th>प्रथम अपिलीय अधिकारी</th>
            <th>द्वितीय अपिलीय अधिकारी</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>
              श्री. ए.आर. जाधव
              <br />
              सहाय्यक प्रकल्प अधिकारी
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
            </td>
            <td>
              श्री. डी.डी. काळपांडे
              <br />
              सहाय्यक प्रकल्प अधिकारी
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
            </td>
            <td>
              श्री. आर.बी. हिवाळे
              <br />
              प्रकल्प अधिकारी
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर, जि. ठाणे
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  );
};

export default LoksevaTable;
