import React from "react";
import "./RTITable.css";
import HeadingText from "../../shared-components/HeadingText";

const RTITable: React.FC = () => {
  return (
    <div className="rti-container">
      <HeadingText text="माहिती अधिकार तक्ता" />
      <p>
        “माहितीचा अधिकार अधिनियम २००५” च्या माहिती अधिकाराच्या अधिनियमातील कलम
        ५(१), ५(२) व १९ नुसार या कार्यालयातील खालील प्रमाणे सहाय्यक शासकीय
        माहिती अधिकारी, शासकीय माहिती अधिकारी व अपिलीय अधिकारी म्हणुन काम
        पाहतील.
      </p>

      <table>
        <thead>
          <tr>
            <th>अ.क्र.</th>
            <th>
              सहाय्यक जन माहिती अधिकारी
              <br />
              नाव, पदनाम, पत्ता
            </th>
            <th>
              जन माहिती अधिकारी
              <br />
              नाव, पदनाम, पत्ता
            </th>
            <th>
              अपिलीय अधिकारी
              <br />
              नाव, पदनाम, पत्ता
            </th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>१</td>
            <td>
              श्री. व्ही.एन. चन्ने
              <br />
              सहाय्यक जन माहिती अधिकारी तथा कार्यालय अधिक्षक
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर
            </td>
            <td>
              श्री. डी.डी. काळपांडे
              <br />
              जन माहिती अधिकारी तथा सहाय्यक प्रकल्प अधिकारी (आस्थापना शाखा)
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर
              <br />
              <br />
              श्री. बी.आर. जाधव
              <br />
              जन माहिती अधिकारी तथा सहाय्यक प्रकल्प अधिकारी (शिक्षण शाखा)
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर
              <br />
              <br />
              श्री. ए.आर. जाधव
              <br />
              जन माहिती अधिकारी तथा सहाय्यक प्रकल्प अधिकारी (विकास शाखा)
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर
            </td>
            <td>
              श्री. आर.बी. हिवाळे
              <br />
              अपिलीय अधिकारी तथा प्रकल्प अधिकारी
              <br />
              एकात्मिक आदिवासी विकास प्रकल्प, शहापूर
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  );
};

export default RTITable;
