import HeadingText from "../shared-components/HeadingText";
import PageLayout from "../shared-components/PageLayout";

const Introduction = () => {
  return (
    <PageLayout>
      {/* <div className="container"> */}
      <HeadingText text="एकात्मिक आदिवासी विकास प्रकल्प, शहापूर" />
      <main className="mt-4">
        <div className="max-w-4xl mx-auto px-4 py-6 text-gray-800 leading-relaxed">
          <p className="mb-4">
            आदिवासींच्या कल्याणाच्या योजनांची परिणामकारक अंमलबजावणी करण्यासाठी
            सन १९७२ मध्ये समाजकल्याण विभागांतर्गत आदिवासी विकास संचलनालयाची
            स्थापना करण्यात आली होती. त्यानंतर राज्य शासनाने आदिवासींसाठी एक
            स्वतंत्र जनजाती क्षेत्र उपयोजना १९७५-७६ मध्ये तयार केली. शासन निर्णय
            क्रमांक :- टी.एस.पी -१०७३/१८१५/डी.एस.आर.व्ही./ दिनांक ०१/०४/१९७७
            नुसार एकात्मिक आदिवासी विकास प्रकल्प शहापूर या कार्यालयाची स्थापना
            करण्यात आली.
          </p>

          <h2 className="text-xl font-semibold mt-6 mb-2 text-[#5E3023]">
            व्याप्ती
          </h2>
          <p className="mb-4">
            प्रकल्प कार्यालय, शहापूर अंतर्गत शहापूर, मुरबाड, भिवंडी, कल्याण,
            उल्हासनगर, अंबरनाथ, व ठाणे हे 7 तालुके मोडतात. संपुर्ण शहापूर
            तालुक्यातील 223 गावे, मुरबाड तालुक्यातील 77 गावे व भिवंडी
            तालुक्यातील 73 गावे आदिवासी उपयोजना क्षेत्रात मोडतात.
          </p>

          <h2 className="text-xl font-semibold mt-6 mb-2 text-[#5E3023]">
            शैक्षणिक संस्था
          </h2>
          <p className="mb-4">
            या प्रकल्पाअंतर्गत 23 शासकीय आश्रमशाळा, 13 अनुदानित आश्रमशाळा व 12
            शासकीय आदिवासी मुलां / मुलींचे वसतिगृह कार्यरत आहेत. त्यात शासकीय
            आश्रमशाळेत 9217, अनुदानित आश्रमशाळेत 5808 व शासकीय वसतीगृहात 945
            विध्यार्थी शिक्षण घेत आहेत.
          </p>

          <h2 className="text-xl font-semibold mt-6 mb-2 text-[#5E3023]">
            कल्याणकारी योजना
          </h2>
          <p className="mb-2">
            आदिवासींच्या सर्वांगीण विकासाकरिता विविध प्रकारच्या योजना राबविल्या
            जातात:
          </p>
          <ul className="list-disc pl-6 space-y-1">
            <li>विशेष केंद्रीय सहाय्य योजना</li>
            <li>न्युक्लीअस बजेट योजना</li>
            <li>नाविन्यपूर्ण योजना</li>
            <li>ठक्करबाप्पा आदिवासी वस्ती सुधार योजना</li>
            <li>कन्यादान योजना</li>
            <li>शबरी घरकुल योजना</li>
          </ul>
        </div>
      </main>
      {/* </div> */}
    </PageLayout>
  );
};

export default Introduction;
